#include <iostream>
using namespace std;

int main()
{
    int a, b;
    cin >> a >> b;
    int* p;

    // 1) ให้ p ชี้ไปที่ a
    p =&a;

    // 2) เพิ่มค่าของ a ขึ้น 5 โดยใช้ p
    
    *p+=5;


    // 3) ให้ p ชี้ไปที่ b
    p = &b;


    // 4) คูณค่าของ b ด้วย 3 โดยใช้ p
    *p *= 3;


    // 5) ให้ q ชี้ไปที่เดียวกับที่ p ชี้อยู่
    int* q =p;

    // 6) ลดค่าที่ q ชี้อยู่ลง 1 โดยใช้ q
    *q -= 1;


    // 7) ให้ c เท่ากับค่าที่ p ชี้อยู่ บวกกับค่าที่ q ชี้อยู่
    int c =*p + *q;

    cout << a << " " << b << " " << c << "\n";
    return 0;
}